0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 308.95;

boundaryField
{
    frontAndBack
    {
        type            zeroGradient;
    }

    Machine_heat
    {
        type            fixedValue;
	value		uniform 323.15; // 50 degC
    }

    Machine_wall
    {
        type            fixedValue;
        value           uniform 305.75; // 32 degC
    }

    Walls
    {
        type            zeroGradient;
    }

    inlet1
    {
        type            fixedValue;
        value           uniform 293.15; // 20 degC
    }

    inlet2
    {
        type            fixedValue;
        value           uniform 293.15; // 20 degC
    }

    outlet1
    {
        type            zeroGradient;
    }

    outlet2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
