0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            noSlip;
    }

    Machine_heat
    {
        type            noSlip;
    }

    Machine_wall
    {
        type            noSlip;
    }

    Walls
    {
        type            noSlip;
    }

    inlet1
    {
	type		fixedValue;
	value		uniform (-3.5 0 0);
    }

    inlet2
    {
	type		fixedValue;
	value		uniform (3.5 0 0);
    }
    outlet1
    {
	type		inletOutlet;
	value		uniform (0 0 0);
	inletValue	uniform (0 0 0);
    }
    outlet2
    {
	type		inletOutlet;
	value		uniform (0 0 0);
	inletValue	uniform (0 0 0);
    }
}


// ************************************************************************* //
