0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontAndBack
    {
        type            zeroGradient;
    }

    Machine_heat
    {
        type            zeroGradient;
    }

    Machine_wall
    {
        type            zeroGradient;
    }

    Walls
    {
        type            zeroGradient;
    }

    inlet1
    {
	type		calculated;
	value		$internalField;
    }

    inlet2
    {
	type		calculated;
	value		$internalField;
    }

    outlet1
    {
	type		fixedValue;
	value		uniform 0;
    }

    outlet2
    {
	type		fixedValue;
	value		uniform 0;
    }
}


// ************************************************************************* //
