constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet1
    {
        type            patch;
        nFaces          132;
        startFace       458974;
    }
    inlet2
    {
        type            patch;
        nFaces          104;
        startFace       459106;
    }
    Machine_heat
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1662;
        startFace       459210;
    }
    Machine_wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          41307;
        startFace       460872;
    }
    outlet1
    {
        type            patch;
        nFaces          14;
        startFace       502179;
    }
    outlet2
    {
        type            patch;
        nFaces          104;
        startFace       502193;
    }
    Walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15018;
        startFace       502297;
    }
)

// ************************************************************************* //
