system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: E:\GoogleDrive\05-OpenFOAM\02.Project\01-SGF_LA\01. Blender-Files\230619-FillingRoomModel.blend
// Export date: 2023-06-23 10:14:34.479956

numberOfSubdomains 1;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
